$(function() {
    "use strict";

    /*
     ----------------------------
     Tooltip
     ----------------------------
     */
    var $window = $(window);

    if ( $window.width() < 360 ) {
        $(document.getElementById('tooltip')).css('right', 0);
    }

    if( navigator.appVersion.indexOf("MSIE 8.") == -1 ) {
        $(document.getElementById('tooltip')).animate({
            top:    '-45px',
            opacity: 1
        }, 600);
    }

    /*
     ----------------------------
     Show code without jQuery
     ----------------------------
     */
    $(document.getElementById('actiontutorial')).on('click', function () {
        $(document.getElementById('tutorial')).slideToggle();
    });

    /*
     ----------------------------
     Custom sidebar
     ----------------------------
     */
    var $sidebar = $(document.getElementById('sidebar')),
        sidebar_width = $sidebar.width();

    if ( $window.width() > 1170 && $sidebar.height() < $window.height() ) {
        $window.on('scroll', function () {
            var $this = $(this);
            if( $this.scrollTop() > 155 && $this.width() > 980 ) {
                $(document.getElementById('tooltip')).hide();
                $sidebar.css({
                    position:   'fixed',
                    top:        '20px',
                    width:      sidebar_width + 'px'
                });
            } else if ( $this.scrollTop() <= 155 ) {
                $(document.getElementById('tooltip')).show();
                $sidebar.removeAttr('style');
            }
        });
    }

    /*
     ----------------------------
     Info
     ----------------------------
     */
	 
    $('.tbmsg').on('click', function () {
        $.fn.custombox( this, {
            effect: 'blur',
			overlayColor:   '#333',
			width:          800,
			eClose:         '.info_head',
			error:          '<h1 class=\'tb_head\'>پیام تاجر بوک</h1><p> شاید امروز آنقدر مشغول کارهای روزمره خود بوده‌اید که فرصت مطالعه اخبار و رویدادهای دنیای فناوری را نیافته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری کنیم. پس با زومیت همراه باشید.</p><span>1393/02/03 12:45</span>'
        });
        return false;
    });
	 
	 
	$('.okmsg').on('click', function () {
        $.fn.custombox( this, {
            effect: 'blur',
			overlayColor:   '#333',
			width:          800,
			eClose:         '.info_head',
			error:          '<h1 class=\'ok_head\'>درخواست شما با موفقیت انجام شد</h1><p> شاید امروز آنقدر مشغول کارهای روزمره خود بوده‌اید که فرصت مطالعه اخبار و رویدادهای دنیای فناوری را نیافته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری کنیم. پس با زومیت همراه باشید.</p><span>1393/02/03 12:45</span>'
        });
        return false;
    });
	
	$('.ermsg').on('click', function () {
        $.fn.custombox( this, {
            effect: 'blur',
			overlayColor:   '#333',
			width:          800,
			eClose:         '.info_head',
			error:          '<h1 class=\'er_head\'>درخواست شما با خطا مواجه شد</h1><p> شاید امروز آنقدر مشغول کارهای روزمره خود بوده‌اید که فرصت مطالعه اخبار و رویدادهای دنیای فناوری را نیافته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری کنیم. پس با زومیت همراه باشید.</p><span>1393/02/03 12:45</span>'
        });
        return false;
    });
	
	$('.almsg').on('click', function () {
        $.fn.custombox( this, {
            effect: 'blur',
			overlayColor:   '#333',
			width:          800,
			eClose:         '.info_head',
			error:          '<h1 class=\'al_head\'>موقعیت مکانی شما ثبت نشده در سیستم </h1><p> شاید امروز آنقدر مشغول کارهای روزمره خود بوده‌اید که فرصت مطالعه اخبار و رویدادهای دنیای فناوری را نیافته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری فته‌اید! ما در جمع‌بندی روزانه، قصد داریم مهمترین مقالات و اخبار ۲۴ ساعت اخیر را برایتان گردآوری کنیم. پس با زومیت همراه باشید.</p><span>1393/02/03 12:45</span>'
        });
        return false;
    });
	
	
    
	
	
	

    

});